Revit 2026 API

# PrimitiveType Enumeration

---

Type of geometry primitive represented as a number.

**Namespace:** Autodesk.Revit.DB.DirectContext3D**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum PrimitiveType
```
```vb
Public Enumeration PrimitiveType
```
```cpp
public enum class PrimitiveType
```
```fsharp
type PrimitiveType
```

| Member name | Value | Description |
| --- | --- | --- |
| LineList | 1 | Geometry consisting of a list of line segments. |
| PointList | 2 | Geometry consisting of a list of points. |
| TriangleList | 0 | Geometry consisting of a list of triangles. |

#### Reference

Autodesk.Revit.DB.DirectContext3D Namespace